src/cf/InformationRegisters/АктуальностьСпискаЗадачБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АктуальностьСпискаЗадачБухгалтера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/АктуальностьСпискаЗадачБухгалтера/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Возвращает дату актуальности списка задач бухгалтера. Если передана пустая ссылка, то
// минимальную дату для всех организаций не помеченных на удаление.
//
Функция ДатаАктуальности(Организация) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктуальностьСпискаЗадачБухгалтера.ДатаАктуальности
		|ИЗ
		|	РегистрСведений.АктуальностьСпискаЗадачБухгалтера КАК АктуальностьСпискаЗадачБухгалтера
		|ГДЕ
		|	АктуальностьСпискаЗадачБухгалтера.Организация = &Организация";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(МИНИМУМ(АктуальностьСпискаЗадачБухгалтера.ДатаАктуальности), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаАктуальности
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальностьСпискаЗадачБухгалтера КАК АктуальностьСпискаЗадачБухгалтера
		|		ПО Организации.Ссылка = АктуальностьСпискаЗадачБухгалтера.Организация
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДатаАктуальности;
	Иначе
		Результат = '00010101'
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
